/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */

package game.service;

/**
 *
 * @author z
 */
public class test {
    
　　
　　梁启超在《少年中国说》中说到：少年强则国强。即便到了现在的年代，这句话也焕发着生机，也没有因为时间的流逝而褪色。而由此，少年如何强？答案其实很明显，教育。
　　单纯把教育拆分出来看的话，“教”和“育”，顾名思义就是教和育是同时进行的。在孩子成长的过程中，教导孩子。
　　从狭义上来说，教育的定义是，培养新生一代准备从事社会生活的整个过程，也是人类社会生产经验得以继承发扬的关键环节，主要指学校对适龄儿童、少年、青年进行培养的过程。
　　从广义上来说，我想凡是能让孩子认识世界，改造世界的途径，也是教育。教育也是需要家庭的教育。
　　学校，
　　家庭，是孩子出生之后的第一个环境，也是长期存在于。
　　家庭教育从古到今都是备受人们的重视，德国教育家福禄贝尔曾说过：“国家的命运与其说是掌握在当权者的手中，倒不如说是掌握在母亲的手中。”虽然这句话抹杀了学校教育的作用，但是这也是深刻指明了父母在教育孩子中的作用。按照传统观念，家庭教育是指在家庭生活中，由家长(其中首先是父母)对其子女实施的教育。而按照现代观念，家庭教育既包括：一、生活中家庭成员(包括父母和子女等)之间相互的影响和教育；家庭教育是学校教育与社会教育的基础。家庭教育又是终身教育，它开始于孩子出生之日(甚至可上溯到胎儿期)，婴幼儿时期的家庭教育是“人之初”的教育，在人的一生中起着奠基的作用。孩子上了小学、中学后，家庭教育既是学校教育的基础，又是学校教育的补充和延伸。}
